ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/R5SS_CCMR_53210000h.xml
<module name="CCMR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CCMR_CCMSR1" acronym="CCMR_CCMSR1" offset="0" width="32" description="CPU Compare Status Register.">
		<bitfield id="CMPE1" width="1" begin="16" end="16" resetval="0x0" description="Compare Error0 = CPU signals are identical1= CPU signal compare mismatchWrites '1' to clear this bit " range="16" rwaccess="R/W"/>
	<bitfield id="STC1" width="1" begin="8" end="8" resetval="0x0" description="Self Test Complete0 = self test on-going if self test mode asserted1 = self test is completeWrites have no effect" range="8" rwaccess="R/W"/>
	<bitfield id="STET1" width="1" begin="1" end="1" resetval="0x0" description="Self Test Error Type0 = self test failed during Compare Match test1 = self test failed during Compare mismatch testWrites have no effect" range="1" rwaccess="R/W"/>
	<bitfield id="STE1" width="1" begin="0" end="0" resetval="0x0" description="Self Test Error0 = self test passed1 = self test failedWrites have no effect" range="0" rwaccess="R"/>
	</register><register id="CCMR_CCMKEYR1" acronym="CCMR_CCMKEYR1" offset="4" width="32" description="CPU Compare Key Register.">
		<bitfield id="MKEY1" width="4" begin="3" end="0" resetval="0x0" description="Mode Key0000= lock step mode0110= self test mode1001= error forcing mode1111= self test error forcing mode" range="3:0" rwaccess="R/W"/>
	</register><register id="CCMR_CCMSR2" acronym="CCMR_CCMSR2" offset="8" width="32" description="VIM Compare Status Register.">
		<bitfield id="CMPE2" width="1" begin="16" end="16" resetval="0x0" description="Compare Error0 = VIM signals are identical1= VIM signal compare mismatchWrites '1' to clear this bit " range="16" rwaccess="R/W"/>
	<bitfield id="STC2" width="1" begin="8" end="8" resetval="0x0" description="Self Test Complete0 = self test on-going if self test mode asserted1 = self test is completeWrites have no effect" range="8" rwaccess="R/W"/>
	<bitfield id="STET2" width="1" begin="1" end="1" resetval="0x0" description="Self Test Error Type0 = self test failed during Compare Match test1 = self test failed during Compare mismatch testWrites have no effect" range="1" rwaccess="R/W"/>
	<bitfield id="STE2" width="1" begin="0" end="0" resetval="0x0" description="Self Test Error0 = self test passed1 = self test failedWrites have no effect" range="0" rwaccess="R/W"/>
	</register><register id="CCMR_CCMKEYR2" acronym="CCMR_CCMKEYR2" offset="12" width="32" description="VIM Compare Key Register.">
		<bitfield id="MKEY2" width="4" begin="3" end="0" resetval="0x0" description="Mode Key0000= lock step mode0110= self test mode1001= error forcing mode1111= self test error forcing mode" range="3:0" rwaccess="R/W"/>
	</register><register id="CCMR_CCMSR3" acronym="CCMR_CCMSR3" offset="16" width="32" description="Inactivity Monitor Status Register.">
		<bitfield id="CMPE3" width="1" begin="16" end="16" resetval="0x0" description="Compare Error0 = Inactivity monitor signals are identical1= Inactivity monitor signal compare mismatchWrites '1' to clear this bit " range="16" rwaccess="R/W"/>
	<bitfield id="STC3" width="1" begin="8" end="8" resetval="0x0" description="Self Test Complete0 = self test on-going if self test mode asserted1 = self test is completeWrites have no effect" range="8" rwaccess="R/W"/>
	<bitfield id="STET3" width="1" begin="1" end="1" resetval="0x0" description="Self Test Error Type0 = self test failed during Compare Match test1 = self test failed during Compare mismatch testWrites have no effect" range="1" rwaccess="R/W"/>
	<bitfield id="STE3" width="1" begin="0" end="0" resetval="0x0" description="Self Test Error0 = self test passed1 = self test failedWrites have no effect" range="0" rwaccess="R"/>
	</register><register id="CCMR_CCMKEYR3" acronym="CCMR_CCMKEYR3" offset="20" width="32" description="Inactivity Monitor Key Register.">
		<bitfield id="MKEY3" width="4" begin="3" end="0" resetval="0x0" description="Mode Key0000= lock step mode0110= self test mode1001= error forcing mode1111= self test error forcing mode" range="3:0" rwaccess="R/W"/>
	</register><register id="CCMR_CCMPOLCNTRL" acronym="CCMR_CCMPOLCNTRL" offset="24" width="32" description="CPU Compare Polarity Control Register.">
		<bitfield id="POL_INV" width="8" begin="7" end="0" resetval="0x0" description="This value is used to invert the 8 XOR of the CPU1 to create compare fail in functional active compare mode. User and privilege mode read = Returns current value of the POL INVPrivilege mode write = Update the values of POL INV" range="7:0" rwaccess="R"/>
	</register>
</module>